#include "support1.cpp"
/* GLOBAL DECLARATIONS */
/* global this */
/* global array_7 */
/* global array_6 */
/* global array_5 */
/* global array_4 */
/* global array_3 */
/* global array_2 */
/* global array_1 */
/* global array_0 */
/* global array */
/* global array_18 */
/* global array_17 */
/* global array_16 */
/* global array_15 */
/* global array_14 */
/* global array_13 */
/* global array_12 */
/* global array_11 */
/* global array_10 */
/* global array_9 */
/* global array_8 */
/* global array_21 */
/* global array_20 */
/* global array_19 */
/* global array_33 */
/* global array_32 */
/* global array_31 */
/* global array_30 */
/* global array_29 */
/* global array_28 */
/* global array_27 */
/* global array_26 */
/* global array_25 */
/* global array_24 */
/* global array_23 */
/* global array_22 */
char simile_identifier[] = "program='AME',version=4.9,edition=enterprise,date=unused,size=241,";
int phasecount = 1;
int paramcount = 7;
int ind=-1;
double ts[2];
double dts[2];
#include "../Functions/procs.cpp"
/* CONSTANT DECLARATIONS */
int array_7[2] = {170, 1};
int array_6[2] = {134, 1};
int array_5[2] = {90, 1};
int array_4[2] = {80, 1};
int array_3[2] = {60, 1};
int array_2[2] = {20, 1};
int array_1[2] = {19, 1};
int array_0[2] = {18, 1};
int array[2] = {10, 1};
double array_18[13] = {0.9728, 0.00591, 0.00677, 612, 1718, 5.5, 0.8456, -2.4386, 722.6, 0.21, -1.0, -3.0, -4.0};
double array_17[13] = {0.66, 0.0036, 0.0064, 230, 1410, 2.65, 0.79, -5.3, 1098, 0.24, -1.5, -3.0, -6.0};
double array_16[13] = {0.66, 0.0036, 0.0064, 230, 1410, 2.65, 0.79, -5.3, 1098, 0.24, -1.9, -3.8, -6.0};
double array_15[13] = {0.74, 0.0043, 0.0061, 229, 1399, 2.85, 0.77, -8.1, 1061, 0.24, -1.9, -3.8, -6.0};
double array_14[13] = {0.63, 0.0043, 0.0061, 219, 1417, 2.79, 0.78, -6.1, 1083, 0.23, -1.8, -3.0, -6.0};
double array_13[13] = {0.65, 0.0033, 0.0063, 278, 1392, 2.69, 0.74, -7.4, 1074, 0.23, -1.6, -3.6, -6.0};
double array_12[13] = {1, 0.0049, 0.0066, 425, 1185, 2.88, 0.86, -4.8, 822, 0.22, -0.7, -3.3, -4.0};
double array_11[13] = {0.74, 0.004, 0.0064, 302, 1369, 2.53, 0.77, -5.5, 1061, 0.25, -1.0, -4.0, -5.0};
double array_10[13] = {0.78, 0.0028, 0.0072, 278, 1358, 2.65, 0.84, -7.5, 891, 0.31, -1.0, -4.0, -5.0};
double array_9[13] = {0.72, 0.0026, 0.0064, 249, 1385, 2.72, 0.74, -8.1, 1125, 0.3, -3.0, -5.0, -8.0};
double array_8[13] = {0.74, 0.0034, 0.0063, 253, 1360, 2.8, 0.8, -9.6, 944, 0.33, -2.4, -5.0, -7.0};
int array_21[3] = {4, 25, 35};
int array_20[3] = {2, 20, 28};
int array_19[3] = {0, 14, 25};
double array_33[7] = {1.51, 47, 32, 20, 125, 5.7, 3847.3};
double array_32[7] = {1.48, 50, 39, 27, 75, 10.6, 4172.3};
double array_31[7] = {1.46, 41, 22, 10, 500, 1.7, 3052.8};
double array_30[7] = {1.44, 38, 16, 8, 800, 1.8, 2627.0};
double array_29[7] = {1.44, 46, 31, 15, 250, 2.8, 3533.1};
double array_28[7] = {1.42, 36, 13, 6, 1500, 1.8, 2390.6};
double array_27[7] = {1.4, 50, 39, 23, 100, 7, 3863.0};
double array_26[7] = {1.37, 46, 33, 13, 150, 1.4, 3404.6};
double array_25[7] = {1.37, 43, 33, 9, 50, 1.4, 3404.6};
double array_24[7] = {1.36, 55, 54, 39, 2, 11, 4567.7};
double array_23[7] = {1.3, 52, 44, 23, 120, 6.4, 3862.5};
double array_22[7] = {1.24, 54, 50, 32, 15, 10.9, 3845.3};
char* inputArcs[] = {"end"};
/* STRUCTURE TYPE DECLARATIONS */

            class Tuber_production_Ftype : public submodeltype {
            public:
                Tuber_production_Ftype () {
                }; /* end(procedure,structor) */
                ~Tuber_production_Ftype () {
                }; /* end(procedure,structor) */
    double DTYf;
    double FTYf;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(DTYf));
        break; /* 1 */
        case 2:
        return(&(FTYf));
        break; /* 2 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Tuber_production_Ftype) */

            class Total_dry_matter_prod_Ftype : public submodeltype {
            public:
                Total_dry_matter_prod_Ftype () {
                }; /* end(procedure,structor) */
                ~Total_dry_matter_prod_Ftype () {
                }; /* end(procedure,structor) */
    double RUEs_0;
    diffs anon_24;
    double TDMf;
    double dTDM_0;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(RUEs_0));
        break; /* 1 */
        case 2:
        return(&(anon_24));
        break; /* 2 */
        case 3:
        return(&(TDMf));
        break; /* 3 */
        case 4:
        return(&(dTDM_0));
        break; /* 4 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Total_dry_matter_prod_Ftype) */

        class Frost_limited_productiontype : public submodeltype {
        public:
            Frost_limited_productiontype () {
            }; /* end(procedure,structor) */
            ~Frost_limited_productiontype () {
            }; /* end(procedure,structor) */
    int ptw_for_delayCC;
    int ptw_for_delayCC_last;
    int ptr_for_delayCC;
    double _array__for_delayCC[1000];
    double _array__for_delayCC_last[1000];
    int ptw_for_delayCCf;
    int ptw_for_delayCCf_last;
    int ptr_for_delayCCf;
    double _array__for_delayCCf[1000];
    double _array__for_delayCCf_last[1000];
    double CCRF;
    double CCL;
    diffs anon_25;
    double c1;
    double fay1;
    double delayCCf;
    double ay1;
    diffs anon_26;
    double c2;
    double fay2;
    double ay2;
    diffs anon_27;
    double C3;
    double CCf;
    double fccf;
    double Tcr;
    double Tld;
    double Trg;
    double Tmin_0;
    diffs anon_28;
    double REB;
    double Reb;
    double reba;
    double CC_0;
    double delayCC;
    double dCC;
    Tuber_production_Ftype Tuber_production_F;
    Total_dry_matter_prod_Ftype Total_dry_matter_prod_F;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(ptw_for_delayCC));
        break; /* 1 */
        case 2:
        return(&(ptw_for_delayCC_last));
        break; /* 2 */
        case 3:
        return(&(ptr_for_delayCC));
        break; /* 3 */
        case 4:
        return(&(_array__for_delayCC[step_list(dims, 2)]));
        break; /* 4 */
        case 5:
        return(&(_array__for_delayCC_last[step_list(dims, 2)]));
        break; /* 5 */
        case 6:
        return(&(ptw_for_delayCCf));
        break; /* 6 */
        case 7:
        return(&(ptw_for_delayCCf_last));
        break; /* 7 */
        case 8:
        return(&(ptr_for_delayCCf));
        break; /* 8 */
        case 9:
        return(&(_array__for_delayCCf[step_list(dims, 2)]));
        break; /* 9 */
        case 10:
        return(&(_array__for_delayCCf_last[step_list(dims, 2)]));
        break; /* 10 */
        case 11:
        return(&(CCRF));
        break; /* 11 */
        case 12:
        return(&(CCL));
        break; /* 12 */
        case 13:
        return(&(anon_25));
        break; /* 13 */
        case 14:
        return(&(c1));
        break; /* 14 */
        case 15:
        return(&(fay1));
        break; /* 15 */
        case 16:
        return(&(delayCCf));
        break; /* 16 */
        case 17:
        return(&(ay1));
        break; /* 17 */
        case 18:
        return(&(anon_26));
        break; /* 18 */
        case 19:
        return(&(c2));
        break; /* 19 */
        case 20:
        return(&(fay2));
        break; /* 20 */
        case 21:
        return(&(ay2));
        break; /* 21 */
        case 22:
        return(&(anon_27));
        break; /* 22 */
        case 23:
        return(&(C3));
        break; /* 23 */
        case 24:
        return(&(CCf));
        break; /* 24 */
        case 25:
        return(&(fccf));
        break; /* 25 */
        case 26:
        return(&(Tcr));
        break; /* 26 */
        case 27:
        return(&(Tld));
        break; /* 27 */
        case 28:
        return(&(Trg));
        break; /* 28 */
        case 29:
        return(&(Tmin_0));
        break; /* 29 */
        case 30:
        return(&(anon_28));
        break; /* 30 */
        case 31:
        return(&(REB));
        break; /* 31 */
        case 32:
        return(&(Reb));
        break; /* 32 */
        case 33:
        return(&(reba));
        break; /* 33 */
        case 34:
        return(&(CC_0));
        break; /* 34 */
        case 35:
        return(&(delayCC));
        break; /* 35 */
        case 36:
        return(&(dCC));
        break; /* 36 */
        case 37:
        return(&(Tuber_production_F));
        break; /* 37 */
        case 38:
        return(&(Total_dry_matter_prod_F));
        break; /* 38 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Frost_limited_productiontype) */

        class Randomizetype : public submodeltype {
        public:
            Randomizetype () {
            }; /* end(procedure,structor) */
            ~Randomizetype () {
            }; /* end(procedure,structor) */
    double rnd_at_init;
    double rnd;
    double rdm;
    double v;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(rnd_at_init));
        break; /* 1 */
        case 2:
        return(&(rnd));
        break; /* 2 */
        case 3:
        return(&(rdm));
        break; /* 3 */
        case 4:
        return(&(v));
        break; /* 4 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Randomizetype) */

            class NITRIFXNWtype : public submodeltype {
            public:
                NITRIFXNWtype () {
                }; /* end(procedure,structor) */
                ~NITRIFXNWtype () {
                }; /* end(procedure,structor) */
    double NO3ppm;
    double SANC;
    double SNH4;
    double ELNC;
    double min;
    double RP2;
    double phn;
    double min1;
    double A;
    double bb;
    double NH4ppm;
    diffs anon;
    double NO3POOL;
    double dNO3;
    double WFD;
    double RP22;
    double RNTRF;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(NO3ppm));
        break; /* 1 */
        case 2:
        return(&(SANC));
        break; /* 2 */
        case 3:
        return(&(SNH4));
        break; /* 3 */
        case 4:
        return(&(ELNC));
        break; /* 4 */
        case 5:
        return(&(min));
        break; /* 5 */
        case 6:
        return(&(RP2));
        break; /* 6 */
        case 7:
        return(&(phn));
        break; /* 7 */
        case 8:
        return(&(min1));
        break; /* 8 */
        case 9:
        return(&(A));
        break; /* 9 */
        case 10:
        return(&(bb));
        break; /* 10 */
        case 11:
        return(&(NH4ppm));
        break; /* 11 */
        case 12:
        return(&(anon));
        break; /* 12 */
        case 13:
        return(&(NO3POOL));
        break; /* 13 */
        case 14:
        return(&(dNO3));
        break; /* 14 */
        case 15:
        return(&(WFD));
        break; /* 15 */
        case 16:
        return(&(RP22));
        break; /* 16 */
        case 17:
        return(&(RNTRF));
        break; /* 17 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,NITRIFXNWtype) */

            class MIN_HUMUStype : public submodeltype {
            public:
                MIN_HUMUStype () {
                }; /* end(procedure,structor) */
                ~MIN_HUMUStype () {
                }; /* end(procedure,structor) */
    double NHUMi;
    double CHUMi;
    diffs anon_0;
    double NHUM;
    double flow109;
    double flow110;
    double MF;
    double TF;
    double RHMIN;
    diffs anon_1;
    double RHMINacum;
    double flow105;
    double DMINR;
    int DMOD;
    diffs anon_2;
    double HUM;
    double MFTF;
    double flow101;
    double flow102;
    diffs anon_3;
    double Hum_decomp__acum;
    double flow103;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(NHUMi));
        break; /* 1 */
        case 2:
        return(&(CHUMi));
        break; /* 2 */
        case 3:
        return(&(anon_0));
        break; /* 3 */
        case 4:
        return(&(NHUM));
        break; /* 4 */
        case 5:
        return(&(flow109));
        break; /* 5 */
        case 6:
        return(&(flow110));
        break; /* 6 */
        case 7:
        return(&(MF));
        break; /* 7 */
        case 8:
        return(&(TF));
        break; /* 8 */
        case 9:
        return(&(RHMIN));
        break; /* 9 */
        case 10:
        return(&(anon_1));
        break; /* 10 */
        case 11:
        return(&(RHMINacum));
        break; /* 11 */
        case 12:
        return(&(flow105));
        break; /* 12 */
        case 13:
        return(&(DMINR));
        break; /* 13 */
        case 14:
        return(&(DMOD));
        break; /* 14 */
        case 15:
        return(&(anon_2));
        break; /* 15 */
        case 16:
        return(&(HUM));
        break; /* 16 */
        case 17:
        return(&(MFTF));
        break; /* 17 */
        case 18:
        return(&(flow101));
        break; /* 18 */
        case 19:
        return(&(flow102));
        break; /* 19 */
        case 20:
        return(&(anon_3));
        break; /* 20 */
        case 21:
        return(&(Hum_decomp__acum));
        break; /* 21 */
        case 22:
        return(&(flow103));
        break; /* 22 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,MIN_HUMUStype) */

                class IMMOBIXNWtype : public submodeltype {
                public:
                    IMMOBIXNWtype () {
                    }; /* end(procedure,structor) */
                    ~IMMOBIXNWtype () {
                    }; /* end(procedure,structor) */
    diffs anon_4;
    double FOM;
    double grcom;
    diffs anon_5;
    double FON;
    double grnom;
    double RNAC;
    double REST;
    double RNACp;
    double rnac;
    double var1;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(anon_4));
        break; /* 1 */
        case 2:
        return(&(FOM));
        break; /* 2 */
        case 3:
        return(&(grcom));
        break; /* 3 */
        case 4:
        return(&(anon_5));
        break; /* 4 */
        case 5:
        return(&(FON));
        break; /* 5 */
        case 6:
        return(&(grnom));
        break; /* 6 */
        case 7:
        return(&(RNAC));
        break; /* 7 */
        case 8:
        return(&(REST));
        break; /* 8 */
        case 9:
        return(&(RNACp));
        break; /* 9 */
        case 10:
        return(&(rnac));
        break; /* 10 */
        case 11:
        return(&(var1));
        break; /* 11 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,IMMOBIXNWtype) */

                class Type_of_OM_addedtype : public submodeltype {
                public:
                    Type_of_OM_addedtype () {
                    }; /* end(procedure,structor) */
                    ~Type_of_OM_addedtype () {
                    }; /* end(procedure,structor) */
    int Type;
    int OM_CN[2];
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Type));
        break; /* 1 */
        case 2:
        return(&(OM_CN[step_list(dims, 2)]));
        break; /* 2 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Type_of_OM_addedtype) */

            class MIN_FOMAtype : public submodeltype {
            public:
                MIN_FOMAtype () {
                }; /* end(procedure,structor) */
                ~MIN_FOMAtype () {
                }; /* end(procedure,structor) */
    diffs anon_6;
    double FPOOLCE;
    double CE;
    double flow1;
    double GRNOMCE;
    double GRNOMLI;
    double LI;
    diffs anon_7;
    double FPOOLLI;
    double flow2;
    diffs anon_8;
    double NCE_acum;
    diffs anon_9;
    double NLI_acum;
    double CA;
    double G1CA;
    diffs anon_10;
    double FPOOLCA;
    double flow6;
    double flow3;
    double flow4;
    double GRNOM;
    diffs anon_11;
    double acumGRNOM;
    double GRNOMCA;
    diffs anon_12;
    double NCA_acum;
    double flow7;
    double G1CE;
    double G1LI;
    double flow107;
    double GRCOM;
    diffs anon_13;
    double acumGRCOM;
    double flow108;
    double _C;
    int CN;
    double _N;
    int FOMi;
    double FONi;
    double FOCi;
    double CNR;
    double CNRF;
    IMMOBIXNWtype IMMOBIXNW;
    Type_of_OM_addedtype Type_of_OM_added;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(anon_6));
        break; /* 1 */
        case 2:
        return(&(FPOOLCE));
        break; /* 2 */
        case 3:
        return(&(CE));
        break; /* 3 */
        case 4:
        return(&(flow1));
        break; /* 4 */
        case 5:
        return(&(GRNOMCE));
        break; /* 5 */
        case 6:
        return(&(GRNOMLI));
        break; /* 6 */
        case 7:
        return(&(LI));
        break; /* 7 */
        case 8:
        return(&(anon_7));
        break; /* 8 */
        case 9:
        return(&(FPOOLLI));
        break; /* 9 */
        case 10:
        return(&(flow2));
        break; /* 10 */
        case 11:
        return(&(anon_8));
        break; /* 11 */
        case 12:
        return(&(NCE_acum));
        break; /* 12 */
        case 13:
        return(&(anon_9));
        break; /* 13 */
        case 14:
        return(&(NLI_acum));
        break; /* 14 */
        case 15:
        return(&(CA));
        break; /* 15 */
        case 16:
        return(&(G1CA));
        break; /* 16 */
        case 17:
        return(&(anon_10));
        break; /* 17 */
        case 18:
        return(&(FPOOLCA));
        break; /* 18 */
        case 19:
        return(&(flow6));
        break; /* 19 */
        case 20:
        return(&(flow3));
        break; /* 20 */
        case 21:
        return(&(flow4));
        break; /* 21 */
        case 22:
        return(&(GRNOM));
        break; /* 22 */
        case 23:
        return(&(anon_11));
        break; /* 23 */
        case 24:
        return(&(acumGRNOM));
        break; /* 24 */
        case 25:
        return(&(GRNOMCA));
        break; /* 25 */
        case 26:
        return(&(anon_12));
        break; /* 26 */
        case 27:
        return(&(NCA_acum));
        break; /* 27 */
        case 28:
        return(&(flow7));
        break; /* 28 */
        case 29:
        return(&(G1CE));
        break; /* 29 */
        case 30:
        return(&(G1LI));
        break; /* 30 */
        case 31:
        return(&(flow107));
        break; /* 31 */
        case 32:
        return(&(GRCOM));
        break; /* 32 */
        case 33:
        return(&(anon_13));
        break; /* 33 */
        case 34:
        return(&(acumGRCOM));
        break; /* 34 */
        case 35:
        return(&(flow108));
        break; /* 35 */
        case 36:
        return(&(_C));
        break; /* 36 */
        case 37:
        return(&(CN));
        break; /* 37 */
        case 38:
        return(&(_N));
        break; /* 38 */
        case 39:
        return(&(FOMi));
        break; /* 39 */
        case 40:
        return(&(FONi));
        break; /* 40 */
        case 41:
        return(&(FOCi));
        break; /* 41 */
        case 42:
        return(&(CNR));
        break; /* 42 */
        case 43:
        return(&(CNRF));
        break; /* 43 */
        case 44:
        return(&(IMMOBIXNW));
        break; /* 44 */
        case 45:
        return(&(Type_of_OM_added));
        break; /* 45 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,MIN_FOMAtype) */

            class UREA_HYDtype : public submodeltype {
            public:
                UREA_HYDtype () {
                }; /* end(procedure,structor) */
                ~UREA_HYDtype () {
                }; /* end(procedure,structor) */
    double AK;
    double SWF;
    double MFU;
    double TFU;
    int UREA;
    double NUREAi;
    double UHYDR;
    double var13;
    double TFF;
    double AKU;
    diffs anon_14;
    double NUREA;
    double flow1_0;
    diffs anon_15;
    double comp2;
    double flow2_0;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(AK));
        break; /* 1 */
        case 2:
        return(&(SWF));
        break; /* 2 */
        case 3:
        return(&(MFU));
        break; /* 3 */
        case 4:
        return(&(TFU));
        break; /* 4 */
        case 5:
        return(&(UREA));
        break; /* 5 */
        case 6:
        return(&(NUREAi));
        break; /* 6 */
        case 7:
        return(&(UHYDR));
        break; /* 7 */
        case 8:
        return(&(var13));
        break; /* 8 */
        case 9:
        return(&(TFF));
        break; /* 9 */
        case 10:
        return(&(AKU));
        break; /* 10 */
        case 11:
        return(&(anon_14));
        break; /* 11 */
        case 12:
        return(&(NUREA));
        break; /* 12 */
        case 13:
        return(&(flow1_0));
        break; /* 13 */
        case 14:
        return(&(anon_15));
        break; /* 14 */
        case 15:
        return(&(comp2));
        break; /* 15 */
        case 16:
        return(&(flow2_0));
        break; /* 16 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,UREA_HYDtype) */

            class FERTILIZERStype : public submodeltype {
            public:
                FERTILIZERStype () {
                }; /* end(procedure,structor) */
                ~FERTILIZERStype () {
                }; /* end(procedure,structor) */
    int amount;
    double NH4_fert;
    double NO3fert;
    double NH4am;
    double NO3am;
    int Fert;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(amount));
        break; /* 1 */
        case 2:
        return(&(NH4_fert));
        break; /* 2 */
        case 3:
        return(&(NO3fert));
        break; /* 3 */
        case 4:
        return(&(NH4am));
        break; /* 4 */
        case 5:
        return(&(NO3am));
        break; /* 5 */
        case 6:
        return(&(Fert));
        break; /* 6 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,FERTILIZERStype) */

        class N_dynamicstype : public submodeltype {
        public:
            N_dynamicstype () {
            }; /* end(procedure,structor) */
            ~N_dynamicstype () {
            }; /* end(procedure,structor) */
    double Nac;
    double flow2_1;
    double var19;
    diffs anon_16;
    double flow205;
    double cd108;
    double NH4o;
    double NNOM;
    diffs anon_17;
    double flow102_0;
    double N_lib_acum;
    double TOTN;
    double NH4u;
    diffs anon_18;
    double NH4POOL;
    double flow4_0;
    NITRIFXNWtype NITRIFXNW;
    MIN_HUMUStype MIN_HUMUS;
    MIN_FOMAtype MIN_FOMA;
    UREA_HYDtype UREA_HYD;
    FERTILIZERStype FERTILIZERS;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Nac));
        break; /* 1 */
        case 2:
        return(&(flow2_1));
        break; /* 2 */
        case 3:
        return(&(var19));
        break; /* 3 */
        case 4:
        return(&(anon_16));
        break; /* 4 */
        case 5:
        return(&(flow205));
        break; /* 5 */
        case 6:
        return(&(cd108));
        break; /* 6 */
        case 7:
        return(&(NH4o));
        break; /* 7 */
        case 8:
        return(&(NNOM));
        break; /* 8 */
        case 9:
        return(&(anon_17));
        break; /* 9 */
        case 10:
        return(&(flow102_0));
        break; /* 10 */
        case 11:
        return(&(N_lib_acum));
        break; /* 11 */
        case 12:
        return(&(TOTN));
        break; /* 12 */
        case 13:
        return(&(NH4u));
        break; /* 13 */
        case 14:
        return(&(anon_18));
        break; /* 14 */
        case 15:
        return(&(NH4POOL));
        break; /* 15 */
        case 16:
        return(&(flow4_0));
        break; /* 16 */
        case 17:
        return(&(NITRIFXNW));
        break; /* 17 */
        case 18:
        return(&(MIN_HUMUS));
        break; /* 18 */
        case 19:
        return(&(MIN_FOMA));
        break; /* 19 */
        case 20:
        return(&(UREA_HYD));
        break; /* 20 */
        case 21:
        return(&(FERTILIZERS));
        break; /* 21 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,N_dynamicstype) */

        class Weathertype : public submodeltype {
        public:
            Weathertype () {
            }; /* end(procedure,structor) */
            ~Weathertype () {
            }; /* end(procedure,structor) */
    double SoilTemp[365];
    double Tsoi;
    double Irrigation[365];
    double Irri;
    double PET[365];
    double ETo;
    double MinTemp[365];
    double MaxTemp[365];
    double Rainfall[365];
    double Tmax;
    double Radiation[365];
    double Tmin;
    double Rain;
    double PAR;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(SoilTemp[step_list(dims, 2)]));
        break; /* 1 */
        case 2:
        return(&(Tsoi));
        break; /* 2 */
        case 3:
        return(&(Irrigation[step_list(dims, 2)]));
        break; /* 3 */
        case 4:
        return(&(Irri));
        break; /* 4 */
        case 5:
        return(&(PET[step_list(dims, 2)]));
        break; /* 5 */
        case 6:
        return(&(ETo));
        break; /* 6 */
        case 7:
        return(&(MinTemp[step_list(dims, 2)]));
        break; /* 7 */
        case 8:
        return(&(MaxTemp[step_list(dims, 2)]));
        break; /* 8 */
        case 9:
        return(&(Rainfall[step_list(dims, 2)]));
        break; /* 9 */
        case 10:
        return(&(Tmax));
        break; /* 10 */
        case 11:
        return(&(Radiation[step_list(dims, 2)]));
        break; /* 11 */
        case 12:
        return(&(Tmin));
        break; /* 12 */
        case 13:
        return(&(Rain));
        break; /* 13 */
        case 14:
        return(&(PAR));
        break; /* 14 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Weathertype) */

        class Varietytype : public submodeltype {
        public:
            Varietytype () {
            }; /* end(procedure,structor) */
            ~Varietytype () {
            }; /* end(procedure,structor) */
    double Inputs[13];
    int Var_Name;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Inputs[step_list(dims, 2)]));
        break; /* 1 */
        case 2:
        return(&(Var_Name));
        break; /* 2 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Varietytype) */

        class Thermal_timetype : public submodeltype {
        public:
            Thermal_timetype () {
            }; /* end(procedure,structor) */
            ~Thermal_timetype () {
            }; /* end(procedure,structor) */
    int Thermal_conditions;
    double TC[3];
    double W;
    diffs anon_19;
    double Tac;
    double Tb;
    double To;
    double Th;
    double Te;
    double Tav;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Thermal_conditions));
        break; /* 1 */
        case 2:
        return(&(TC[step_list(dims, 2)]));
        break; /* 2 */
        case 3:
        return(&(W));
        break; /* 3 */
        case 4:
        return(&(anon_19));
        break; /* 4 */
        case 5:
        return(&(Tac));
        break; /* 5 */
        case 6:
        return(&(Tb));
        break; /* 6 */
        case 7:
        return(&(To));
        break; /* 7 */
        case 8:
        return(&(Th));
        break; /* 8 */
        case 9:
        return(&(Te));
        break; /* 9 */
        case 10:
        return(&(Tav));
        break; /* 10 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Thermal_timetype) */

            class Planting_Datetype : public submodeltype {
            public:
                Planting_Datetype () {
                }; /* end(procedure,structor) */
                ~Planting_Datetype () {
                }; /* end(procedure,structor) */
    int dd;
    int mm;
    int PDate;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(dd));
        break; /* 1 */
        case 2:
        return(&(mm));
        break; /* 2 */
        case 3:
        return(&(PDate));
        break; /* 3 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Planting_Datetype) */

        class Timetype : public submodeltype {
        public:
            Timetype () {
            }; /* end(procedure,structor) */
            ~Timetype () {
            }; /* end(procedure,structor) */
    int month;
    double day;
    int EDay;
    double DAE;
    double PDay;
    Planting_Datetype Planting_Date;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(month));
        break; /* 1 */
        case 2:
        return(&(day));
        break; /* 2 */
        case 3:
        return(&(EDay));
        break; /* 3 */
        case 4:
        return(&(DAE));
        break; /* 4 */
        case 5:
        return(&(PDay));
        break; /* 5 */
        case 6:
        return(&(Planting_Date));
        break; /* 6 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Timetype) */

            class Soil_temp_esttype : public submodeltype {
            public:
                Soil_temp_esttype () {
                }; /* end(procedure,structor) */
                ~Soil_temp_esttype () {
                }; /* end(procedure,structor) */
    double k;
    double c;
    double Stemp;
    double Tl;
    int Dl;
    double D;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(k));
        break; /* 1 */
        case 2:
        return(&(c));
        break; /* 2 */
        case 3:
        return(&(Stemp));
        break; /* 3 */
        case 4:
        return(&(Tl));
        break; /* 4 */
        case 5:
        return(&(Dl));
        break; /* 5 */
        case 6:
        return(&(D));
        break; /* 6 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Soil_temp_esttype) */

        class Soil_parameterstype : public submodeltype {
        public:
            Soil_parameterstype () {
            }; /* end(procedure,structor) */
            ~Soil_parameterstype () {
            }; /* end(procedure,structor) */
    double Po;
    double cl;
    double FC;
    double WP;
    double CL;
    int OM;
    double OMw;
    double OC;
    double ISM;
    int pH;
    double fc;
    double wp;
    int Soil_texture;
    double Hydric[7];
    int Area;
    double Soil_depth;
    double Soil_Vol;
    double SWeight;
    double BD;
    Soil_temp_esttype Soil_temp_est;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Po));
        break; /* 1 */
        case 2:
        return(&(cl));
        break; /* 2 */
        case 3:
        return(&(FC));
        break; /* 3 */
        case 4:
        return(&(WP));
        break; /* 4 */
        case 5:
        return(&(CL));
        break; /* 5 */
        case 6:
        return(&(OM));
        break; /* 6 */
        case 7:
        return(&(OMw));
        break; /* 7 */
        case 8:
        return(&(OC));
        break; /* 8 */
        case 9:
        return(&(ISM));
        break; /* 9 */
        case 10:
        return(&(pH));
        break; /* 10 */
        case 11:
        return(&(fc));
        break; /* 11 */
        case 12:
        return(&(wp));
        break; /* 12 */
        case 13:
        return(&(Soil_texture));
        break; /* 13 */
        case 14:
        return(&(Hydric[step_list(dims, 2)]));
        break; /* 14 */
        case 15:
        return(&(Area));
        break; /* 15 */
        case 16:
        return(&(Soil_depth));
        break; /* 16 */
        case 17:
        return(&(Soil_Vol));
        break; /* 17 */
        case 18:
        return(&(SWeight));
        break; /* 18 */
        case 19:
        return(&(BD));
        break; /* 19 */
        case 20:
        return(&(Soil_temp_est));
        break; /* 20 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Soil_parameterstype) */

        class Soil_water_Balancetype : public submodeltype {
        public:
            Soil_water_Balancetype () {
            }; /* end(procedure,structor) */
            ~Soil_water_Balancetype () {
            }; /* end(procedure,structor) */
    double Eo;
    double s;
    diffs anon_20;
    double CS;
    double S;
    double To_0;
    double T;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Eo));
        break; /* 1 */
        case 2:
        return(&(s));
        break; /* 2 */
        case 3:
        return(&(anon_20));
        break; /* 3 */
        case 4:
        return(&(CS));
        break; /* 4 */
        case 5:
        return(&(S));
        break; /* 5 */
        case 6:
        return(&(To_0));
        break; /* 6 */
        case 7:
        return(&(T));
        break; /* 7 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Soil_water_Balancetype) */

            class Water_stresstype : public submodeltype {
            public:
                Water_stresstype () {
                }; /* end(procedure,structor) */
                ~Water_stresstype () {
                }; /* end(procedure,structor) */
    diffs anon_21;
    double Ws;
    double CWs;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(anon_21));
        break; /* 1 */
        case 2:
        return(&(Ws));
        break; /* 2 */
        case 3:
        return(&(CWs));
        break; /* 3 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Water_stresstype) */

            class Total_dry_matter_production_Wtype : public submodeltype {
            public:
                Total_dry_matter_production_Wtype () {
                }; /* end(procedure,structor) */
                ~Total_dry_matter_production_Wtype () {
                }; /* end(procedure,structor) */
    diffs anon_22;
    double dTDM;
    double TDMw;
    double RUEw;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(anon_22));
        break; /* 1 */
        case 2:
        return(&(dTDM));
        break; /* 2 */
        case 3:
        return(&(TDMw));
        break; /* 3 */
        case 4:
        return(&(RUEw));
        break; /* 4 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Total_dry_matter_production_Wtype) */

            class Tuber_production_Wtype : public submodeltype {
            public:
                Tuber_production_Wtype () {
                }; /* end(procedure,structor) */
                ~Tuber_production_Wtype () {
                }; /* end(procedure,structor) */
    double DTYw;
    double FTYw;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(DTYw));
        break; /* 1 */
        case 2:
        return(&(FTYw));
        break; /* 2 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Tuber_production_Wtype) */

            class Canopy_Cover_Wtype : public submodeltype {
            public:
                Canopy_Cover_Wtype () {
                }; /* end(procedure,structor) */
                ~Canopy_Cover_Wtype () {
                }; /* end(procedure,structor) */
    double CCw;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(CCw));
        break; /* 1 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Canopy_Cover_Wtype) */

        class Water_limited_productiontype : public submodeltype {
        public:
            Water_limited_productiontype () {
            }; /* end(procedure,structor) */
            ~Water_limited_productiontype () {
            }; /* end(procedure,structor) */
    double RUEs;
    Water_stresstype Water_stress;
    Total_dry_matter_production_Wtype Total_dry_matter_production_W;
    Tuber_production_Wtype Tuber_production_W;
    Canopy_Cover_Wtype Canopy_Cover_W;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(RUEs));
        break; /* 1 */
        case 2:
        return(&(Water_stress));
        break; /* 2 */
        case 3:
        return(&(Total_dry_matter_production_W));
        break; /* 3 */
        case 4:
        return(&(Tuber_production_W));
        break; /* 4 */
        case 5:
        return(&(Canopy_Cover_W));
        break; /* 5 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Water_limited_productiontype) */

            class Canopy_covertype : public submodeltype {
            public:
                Canopy_covertype () {
                }; /* end(procedure,structor) */
                ~Canopy_covertype () {
                }; /* end(procedure,structor) */
    double flinti;
    double N;
    double Flint1;
    double Flint2;
    double CC;
    double d;
    double f0;
    double R0;
    double t50;
    double MCC;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(flinti));
        break; /* 1 */
        case 2:
        return(&(N));
        break; /* 2 */
        case 3:
        return(&(Flint1));
        break; /* 3 */
        case 4:
        return(&(Flint2));
        break; /* 4 */
        case 5:
        return(&(CC));
        break; /* 5 */
        case 6:
        return(&(d));
        break; /* 6 */
        case 7:
        return(&(f0));
        break; /* 7 */
        case 8:
        return(&(R0));
        break; /* 8 */
        case 9:
        return(&(t50));
        break; /* 9 */
        case 10:
        return(&(MCC));
        break; /* 10 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Canopy_covertype) */

            class Total_dry_matter_productiontype : public submodeltype {
            public:
                Total_dry_matter_productiontype () {
                }; /* end(procedure,structor) */
                ~Total_dry_matter_productiontype () {
                }; /* end(procedure,structor) */
    double RUE;
    diffs anon_23;
    double TDM;
    double dW;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(RUE));
        break; /* 1 */
        case 2:
        return(&(anon_23));
        break; /* 2 */
        case 3:
        return(&(TDM));
        break; /* 3 */
        case 4:
        return(&(dW));
        break; /* 4 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Total_dry_matter_productiontype) */

            class Tuber_productiontype : public submodeltype {
            public:
                Tuber_productiontype () {
                }; /* end(procedure,structor) */
                ~Tuber_productiontype () {
                }; /* end(procedure,structor) */
    double M;
    double A_0;
    double DTY;
    double b;
    double Part;
    double DMcont;
    double FTY;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(M));
        break; /* 1 */
        case 2:
        return(&(A_0));
        break; /* 2 */
        case 3:
        return(&(DTY));
        break; /* 3 */
        case 4:
        return(&(b));
        break; /* 4 */
        case 5:
        return(&(Part));
        break; /* 5 */
        case 6:
        return(&(DMcont));
        break; /* 6 */
        case 7:
        return(&(FTY));
        break; /* 7 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Tuber_productiontype) */

        class Potential_productiontype : public submodeltype {
        public:
            Potential_productiontype () {
            }; /* end(procedure,structor) */
            ~Potential_productiontype () {
            }; /* end(procedure,structor) */
    Canopy_covertype Canopy_cover;
    Total_dry_matter_productiontype Total_dry_matter_production;
    Tuber_productiontype Tuber_production;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Canopy_cover));
        break; /* 1 */
        case 2:
        return(&(Total_dry_matter_production));
        break; /* 2 */
        case 3:
        return(&(Tuber_production));
        break; /* 3 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Potential_productiontype) */

            class Canopy_cover_Ntype : public submodeltype {
            public:
                Canopy_cover_Ntype () {
                }; /* end(procedure,structor) */
                ~Canopy_cover_Ntype () {
                }; /* end(procedure,structor) */
    double CCn;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(CCn));
        break; /* 1 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Canopy_cover_Ntype) */

            class Total_dry_matter_production_Ntype : public submodeltype {
            public:
                Total_dry_matter_production_Ntype () {
                }; /* end(procedure,structor) */
                ~Total_dry_matter_production_Ntype () {
                }; /* end(procedure,structor) */
    diffs anon_29;
    double dTDM_1;
    double TDMn;
    double RUE_0;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(anon_29));
        break; /* 1 */
        case 2:
        return(&(dTDM_1));
        break; /* 2 */
        case 3:
        return(&(TDMn));
        break; /* 3 */
        case 4:
        return(&(RUE_0));
        break; /* 4 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Total_dry_matter_production_Ntype) */

            class Tuber_production_Ntype : public submodeltype {
            public:
                Tuber_production_Ntype () {
                }; /* end(procedure,structor) */
                ~Tuber_production_Ntype () {
                }; /* end(procedure,structor) */
    double FTYn;
    double DTYn;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(FTYn));
        break; /* 1 */
        case 2:
        return(&(DTYn));
        break; /* 2 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Tuber_production_Ntype) */

            class N_stresstype : public submodeltype {
            public:
                N_stresstype () {
                }; /* end(procedure,structor) */
                ~N_stresstype () {
                }; /* end(procedure,structor) */
    double Npot;
    double Npc;
    double NacNpot;
    double GC0;
    int GC250;
    double Ns;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Npot));
        break; /* 1 */
        case 2:
        return(&(Npc));
        break; /* 2 */
        case 3:
        return(&(NacNpot));
        break; /* 3 */
        case 4:
        return(&(GC0));
        break; /* 4 */
        case 5:
        return(&(GC250));
        break; /* 5 */
        case 6:
        return(&(Ns));
        break; /* 6 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,N_stresstype) */

        class Nitrogen_limited_productiontype : public submodeltype {
        public:
            Nitrogen_limited_productiontype () {
            }; /* end(procedure,structor) */
            ~Nitrogen_limited_productiontype () {
            }; /* end(procedure,structor) */
    Canopy_cover_Ntype Canopy_cover_N;
    Total_dry_matter_production_Ntype Total_dry_matter_production_N;
    Tuber_production_Ntype Tuber_production_N;
    N_stresstype N_stress;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Canopy_cover_N));
        break; /* 1 */
        case 2:
        return(&(Total_dry_matter_production_N));
        break; /* 2 */
        case 3:
        return(&(Tuber_production_N));
        break; /* 3 */
        case 4:
        return(&(N_stress));
        break; /* 4 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Nitrogen_limited_productiontype) */

    class Sol_integral_2012_Tor_9394_9type : public submodeltype {
    public:
        Sol_integral_2012_Tor_9394_9type () {
        }; /* end(procedure,structor) */
        ~Sol_integral_2012_Tor_9394_9type () {
        }; /* end(procedure,structor) */
    Frost_limited_productiontype Frost_limited_production;
    Randomizetype Randomize;
    N_dynamicstype N_dynamics;
    Weathertype Weather;
    Varietytype Variety;
    Thermal_timetype Thermal_time;
    Timetype Time;
    Soil_parameterstype Soil_parameters;
    Soil_water_Balancetype Soil_water_Balance;
    Water_limited_productiontype Water_limited_production;
    Potential_productiontype Potential_production;
    Nitrogen_limited_productiontype Nitrogen_limited_production;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Frost_limited_production));
        break; /* 1 */
        case 2:
        return(&(Randomize));
        break; /* 2 */
        case 3:
        return(&(N_dynamics));
        break; /* 3 */
        case 4:
        return(&(Weather));
        break; /* 4 */
        case 5:
        return(&(Variety));
        break; /* 5 */
        case 6:
        return(&(Thermal_time));
        break; /* 6 */
        case 7:
        return(&(Time));
        break; /* 7 */
        case 8:
        return(&(Soil_parameters));
        break; /* 8 */
        case 9:
        return(&(Soil_water_Balance));
        break; /* 9 */
        case 10:
        return(&(Water_limited_production));
        break; /* 10 */
        case 11:
        return(&(Potential_production));
        break; /* 11 */
        case 12:
        return(&(Nitrogen_limited_production));
        break; /* 12 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
}; /* end(class,Sol_integral_2012_Tor_9394_9type) */

class AME_model : public submodeltype {
public:
    AME_model () {
    }; /* end(procedure,structor) */
    ~AME_model () {
    }; /* end(procedure,structor) */
    Sol_integral_2012_Tor_9394_9type Sol_integral_2012_Tor_9394_9;
void* get_pointer (int id, int** dims) {
    switch (id) {
        case 1:
        return(&(Sol_integral_2012_Tor_9394_9));
        break; /* 1 */
    }; /* end(switch,id) */
    return(NULL);
}; /* end(procedure,get_pointer) */
/* EVALUATION PROCEDURE DECLARATION */

void updatemodel (double start_time, int phase) {

/* GLOBAL DECLARATIONS */
/* global this */
/* global array_7 */
/* global array_6 */
/* global array_5 */
/* global array_4 */
/* global array_3 */
/* global array_2 */
/* global array_1 */
/* global array_0 */
/* global array */
/* global array_18 */
/* global array_17 */
